alirezazd/32raven/stm32/Drivers/battery.cpp
// SPDX-License-Identifier: GPL-3.0-only
// Copyright (C) 2026 Alireza Azadi

#include "battery.hpp"

#include "error_code.hpp"
#include "panic.hpp"
#include "stm32f4xx.h"
#include "system.hpp"

namespace {

constexpr float kMilli = 1000.0f;
constexpr float kMicrosecondsPerMahAtOneAmp = 3600000.0f;
constexpr uint32_t kAdcSampleTime480Cycles = 7u;

void SetAdcSampleTime(uint8_t channel, uint32_t sample_time) {
  const uint32_t shift = static_cast<uint32_t>(channel % 10u) * 3u;
  if (channel <= 9u) {
    ADC1->SMPR2 &= ~(0x7u << shift);
    ADC1->SMPR2 |= sample_time << shift;
  } else {
    ADC1->SMPR1 &= ~(0x7u << shift);
    ADC1->SMPR1 |= sample_time << shift;
  }
}

bool WaitForEoc(uint16_t timeout_us) {
  const TimeBase &time = System::GetInstance().Time();
  const uint32_t start_us = time.Micros();
  while ((ADC1->SR & ADC_SR_EOC) == 0u) {
    if (static_cast<uint32_t>(time.Micros() - start_us) >= timeout_us) {
      return false;
    }
  }
  return true;
}

float ClampFloat(float value, float low, float high) {
  if (value < low) return low;
  if (value > high) return high;
  return value;
}

}  // namespace

Battery &Battery::GetInstance() {
  static Battery instance;
  return instance;
}

void Battery::Init(const Config &cfg) {
  if (initialized_) {
    Panic(ErrorCode::Stm32::kAdcInitFailed);
  }

  if (cfg.sample_period_us == 0u || cfg.adc_reference_mv == 0u ||
      cfg.oversample_count == 0u || cfg.filter_alpha <= 0.0f ||
      cfg.filter_alpha > 1.0f || cfg.adc_timeout_us == 0u ||
      cfg.voltage_multiplier_milli == 0u || cfg.current_scale_ma_per_v == 0u ||
      cfg.cell_count == 0u || cfg.cell_empty_mv >= cfg.cell_full_mv ||
      cfg.voltage_adc_channel == cfg.current_adc_channel) {
    Panic(ErrorCode::Stm32::kAdcInitFailed);
  }

  cfg_ = cfg;

  mah_drawn_ = static_cast<float>(cfg_.initial_mah_drawn);
  data_ = {};
  data_.mah_drawn = mah_drawn_;

  InitAdc();
  initialized_ = true;
}

void Battery::Poll(uint32_t now_us) {
  if (last_sample_us_ != 0u &&
      static_cast<uint32_t>(now_us - last_sample_us_) < cfg_.sample_period_us) {
    return;
  }

  last_sample_us_ = now_us;
  const AdcPair sample = ReadAdcPair();
  if (!sample.valid) {
    adc_error_count_++;
    return;
  }

  PublishSample(now_us, sample.voltage_raw, sample.current_raw);
}

void Battery::InitAdc() {
  // GPIO/port clocks for kEscVba/kEscCur are set by GPIO::Init(); only the
  // ADC1 clock + peripheral programming belong here.
  RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;
  (void)RCC->APB2ENR;

  ADC->CCR = (ADC->CCR & ~ADC_CCR_ADCPRE) |
             (static_cast<uint32_t>(cfg_.adc_prescaler_bits) << ADC_CCR_ADCPRE_Pos);

  ADC1->CR1 = ADC_CR1_SCAN;
  ADC1->CR2 = ADC_CR2_EOCS;
  ADC1->SQR1 = ADC_SQR1_L_0;  // 2 regular conversions.
  ADC1->SQR2 = 0;
  ADC1->SQR3 = static_cast<uint32_t>(cfg_.voltage_adc_channel) |
               (static_cast<uint32_t>(cfg_.current_adc_channel) << 5u);

  SetAdcSampleTime(cfg_.voltage_adc_channel, kAdcSampleTime480Cycles);
  SetAdcSampleTime(cfg_.current_adc_channel, kAdcSampleTime480Cycles);

  ADC1->SR = 0;
  ADC1->CR2 |= ADC_CR2_ADON;
}

Battery::AdcPair Battery::ReadAdcPair() {
  uint32_t voltage_acc = 0;
  uint32_t current_acc = 0;

  for (uint8_t i = 0; i < cfg_.oversample_count; ++i) {
    ADC1->SR = 0;
    ADC1->CR2 |= ADC_CR2_SWSTART;

    if (!WaitForEoc(cfg_.adc_timeout_us)) {
      return AdcPair{0, 0, false};
    }
    voltage_acc += ADC1->DR & ADC_DR_DATA;

    if (!WaitForEoc(cfg_.adc_timeout_us)) {
      return AdcPair{0, 0, false};
    }
    current_acc += ADC1->DR & ADC_DR_DATA;
  }

  // Init rejects a zero oversample_count, which the analyzer cannot carry in
  // from there.
  // NOLINTBEGIN(clang-analyzer-core.DivideZero)
  return AdcPair{
      static_cast<uint16_t>(voltage_acc / cfg_.oversample_count),
      static_cast<uint16_t>(current_acc / cfg_.oversample_count),
      true,
  };
  // NOLINTEND(clang-analyzer-core.DivideZero)
}

void Battery::PublishSample(uint32_t now_us, uint16_t voltage_raw,
                            uint16_t current_raw) {
  last_voltage_raw_ = voltage_raw;
  last_current_raw_ = current_raw;

  const float voltage_adc_mv =
      (static_cast<float>(voltage_raw) * cfg_.adc_reference_mv) /
      Battery::kAdcMaxRaw;
  const float current_adc_mv =
      (static_cast<float>(current_raw) * cfg_.adc_reference_mv) /
      Battery::kAdcMaxRaw;

  float measured_voltage_v =
      ((voltage_adc_mv * cfg_.voltage_multiplier_milli) / kMilli +
       cfg_.voltage_offset_mv) /
      kMilli;
  if (measured_voltage_v < 0.0f) {
    measured_voltage_v = 0.0f;
  }

  float measured_current_a =
      ((current_adc_mv - static_cast<float>(cfg_.current_offset_mv)) *
       cfg_.current_scale_ma_per_v) /
      (kMilli * kMilli);

  if (measured_current_a < 0.0f) {
    measured_current_a = 0.0f;
  }
  if (measured_current_a <
      static_cast<float>(cfg_.current_deadband_ma) / kMilli) {
    measured_current_a = 0.0f;
  }

  if (!filter_valid_) {
    filtered_voltage_v_ = measured_voltage_v;
    filtered_current_a_ = measured_current_a;
    filter_valid_ = true;
  } else {
    const float alpha = cfg_.filter_alpha;
    filtered_voltage_v_ += alpha * (measured_voltage_v - filtered_voltage_v_);
    filtered_current_a_ += alpha * (measured_current_a - filtered_current_a_);
  }

  if (last_integrator_us_ != 0u && filtered_current_a_ > 0.0f) {
    const uint32_t dt_us = static_cast<uint32_t>(now_us - last_integrator_us_);
    mah_drawn_ += (filtered_current_a_ * static_cast<float>(dt_us)) /
                  kMicrosecondsPerMahAtOneAmp;
  }
  last_integrator_us_ = now_us;

  data_.voltage = filtered_voltage_v_;
  data_.current = filtered_current_a_;
  data_.mah_drawn = mah_drawn_;
  data_.percentage = EstimatePercentage(filtered_voltage_v_);
}

uint8_t Battery::EstimatePercentage(float voltage_v) const {
  const float cell_voltage_mv =
      (voltage_v * kMilli) / static_cast<float>(cfg_.cell_count);
  const float pct = ((cell_voltage_mv - cfg_.cell_empty_mv) * 100.0f) /
                    static_cast<float>(cfg_.cell_full_mv - cfg_.cell_empty_mv);

  return static_cast<uint8_t>(ClampFloat(pct, 0.0f, 100.0f));
}
